'use client'

import { Select, MenuItem, TextField, Slider, FormControl, InputLabel, Grid, Button, Box, Autocomplete } from '@mui/material';


const FilteringMenu = () => {
    return null;
    const cities = [
        'Белгородская область',

        'Брянская область',

        'Владимирская область',

        'Воронежская область',

        'Ивановская область',

        'Калужская область',

        'Костромская область',

        'Курская область',

        'Липецкая область',

        'Московская область',

        'Орловская область',

        'Рязанская область',

        'Смоленская область',

        'Тамбовская область',

        'Тверская область',

        'Тульская область',

        'Ярославская область',

        'Москва',

        'Республика Адыгея',

        'Республика Калмыкия',

        'Краснодарский край',

        'Астраханская область',

        'Волгоградская область',

        'Ростовская область',

        'Республика Карелия',

        'Республика Коми',

        'Архангельская область',

        'Вологодская область',

        'Калининградская область',

        'Ленинградская область',

        'Мурманская область',

        'Новгородская область',
        'Псковская область',

        'Санкт-Петербург',

        'Ненецкий автономный округ',

        'Республика Саха (Якутия)',

        'Камчатский край',

        'Приморский край',

        'Хабаровский край',

        'Амурская область',

        'Магаданская область',

        'Сахалинская область',

        'Еврейская автономная область',

        'Чукотский автономный округ',

        'Республика Алтай',

        'Республика Бурятия',

        'Республика Тыва',

        'Республика Хакасия',

        'Алтайский край',

        'Забайкальский край',

        'Красноярский край',

        'Иркутская область',

        'Кемеровская область',

        'Новосибирская область',

        'Омская область',

        'Томская область',

        'Курганская область',

        'Свердловская область',

        'Тюменская область',

        'Челябинская область',

        'Ханты-Мансийский автономный округ — Югра',

        'Ямало-Ненецкий автономный округ',

        'Республика Башкортостан',

        'Республика Марий Эл',

        'Республика Мордовия',

        'Республика Татарстан',

        'Удмуртская Республика',

        'Чувашская Республика',

        'Кировская область',

        'Нижегородская область',

        'Оренбургская область',

        'Пензенская область',

        'Пермский край',

        'Самарская область',

        'Саратовская область',

        'Ульяновская область',

        'Республика Дагестан',

        'Республика Ингушетия',

        'Кабардино-Балкарская Республика',

        'Карачаево-Черкесская Республика',

        'Республика Северная Осетия — Алания',

        'Чеченская Республика',

        'Ставропольский край']

    return (
        <Box sx={{ mr: '40px' }}>
            <form>
                <Autocomplete
                    options={cities}
                    renderInput={(params) =>
                        <TextField
                            {...params}
                            label="Регион"
                            variant="standard"
                        />
                    }
                />
                <Autocomplete
                    sx={{ mb: '10px', mt: '10px' }}
                    options={['Option 1', 'Option 2', 'Option 3']}
                    renderInput={(params) =>
                        <TextField
                            {...params}
                            label="Город"
                            variant="standard"
                        />
                    }
                />
                <Autocomplete
                    multiple
                    options={['Студия', '1', '2', '3', '4', '5', 'Более']}
                    renderInput={(params) =>
                        <TextField
                            {...params}
                            label="Колиичество комнат"
                            variant="standard"
                        />
                    }
                />
                <TextField
                    type='number'
                    label="Мин.Цена"
                    fullWidth
                    variant="standard"
                    margin="normal"
                />
                <TextField
                    type='number'
                    label="Макс.Цена"
                    fullWidth
                    variant="standard"
                    margin="normal"
                />
                <Box sx={{ mt: '20px', mb: '20px' }}>
                    <Button type="submit">
                        Поиск
                    </Button>
                </Box>
            </form>
        </Box>
    );
};

export default FilteringMenu;